Revit 2024 API
ExtrusionRoof.GetProfile Method
Retrieve the Profile of ExtrusionRoof.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ModelCurveArray GetProfile()
Visual Basic
Public Function GetProfile As ModelCurveArray
Visual C++
public:
ModelCurveArray^ GetProfile()
See Also
ExtrusionRoof Class
Autodesk.Revit.DB Namespace